#include <stdio.h>
#include <math.h>
int a = 1, b = -2, c = -24; // объявил 3 целочисленных  переменных с значениями
double x1, x2, d; // объявил 3 переменные с павающей запятой (потому, что тип double)
// сишка это строго типизированный язык програмиирования... тоесть каждому объекту, который мы создаём, необходимо указать его тип данных
// если бы я указал 'int' или "double" вместо "void" я бы подразумевал, что функция вернет значение соответствующего типа . Так как я указал "void", функция ничего не возвращает
void main(){ // объявил функцию "main" типа "void" потому, что функция выполняет вывод на экран // нет необходимости возвращать значение
    d = pow(b, 2) - 4 * a * c; // в переменную 'd' я сохранил значение дискременанта // команда "pow" возводит в степень
    if (d > 0) { // с помощью условной конструкции IF определяем дальнейшие действия
        x1 = (-b + sqrt(d)) / (a * 2); //sqrt возвращает квадратный корень значения
        x2 = (-b - sqrt(d)) / (a * 2);
        printf("x1 = %f , x2 = %f" , x1 , x2); //printf консольный вывод форматированного текста //%f — вещественный формат (числа с плавающей точкой типа float);
    } else if (d==0){ // в 9 строке рассматривал условие если дискременант больше 0, тут рассматриваю если равен 0
        x1 = (-b) / (a * 2);
        printf("x1 = %f" , x1);
    } else // д меньше 0 
    {printf("корней нет");}
}